Web Services/1. Webservice Testing/Transactions/findTransactions/Test Case 18/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:transactionSearchCriteria>
         <!--Optional:-->
         <tran:customerID>266062</tran:customerID>
         <!--Optional:-->
         <tran:fromDate>2009-01-01</tran:fromDate>
         <!--Optional:-->
         <tran:toDate>2009-02-02</tran:toDate>
         <tran:limitOfResults>2</tran:limitOfResults>
         <tran:partnerFunctionList>

             <tran:partnerFunction>PARTNER_FUNCTION_BILLTO</tran:partnerFunction>
	  
         </tran:partnerFunctionList>

       
      </tran:transactionSearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>